/*
Localizations.strings
NovaFoundation

Created by Logan Collins on 6/22/16.
Copyright © 2016 Panic Inc. All rights reserved.
*/


// General
"None" = "None";


// Clips
"Editor" = "Editor";
"Terminal" = "Terminal";
"Plain Text" = "Reiner Text";

"SELECTED_TEXT" = "Text Selection";
"DATE" = "Date";
"FILENAME" = "Filename";
"FILE_PATH" = "File Path";
"PARENT_FOLDER" = "Parent Folder";
"WORKSPACE_NAME" = "Project Name";
"AUTHOR_NAME" = "Author Name";
"SCM_REVISION" = "SCM Revision";
"PREVIOUS_TEXT" = "Previous Text";
"PASTEBOARD_TEXT" = "Pasteboard Text";


// Keyboard
"Space" = "Space";
"Insert" = "Insert";
"Clear" = "Clear";
"Help" = "Help";


// Extensions
"The extension “%@” was not found." = "The extension “%@” was not found.";
"The extension “%@” experienced an error." = "The extension “%@” experienced an error.";
"The extension “%@” could not be loaded because it requires %@ %@ or later." = "The extension “%@” could not be loaded because it requires %@ %@ or later.";

"No command found with the name “%@”." = "No command found with the name “%@”.";
"Check to make sure the extension for the command is installed and up to date." = "Check to make sure the extension for the command is installed and up to date.";

"No assistant found with the name “%@”." = "No assistant found with the name “%@”.";
"Check to make sure the extension for the assistant is installed and up to date." = "Check to make sure the extension for the assistant is installed and up to date.";

"The extension “%@” is already installed." = "The extension “%@” is already installed.";
"If you would like to modify the provided extension, copy it outside of the extensions container directory and open it as a workspace." = "If you would like to modify the provided extension, copy it outside of the extensions container directory and open it as a workspace.";

"An extension with the identifier “%@” is already installed." = "An extension with the identifier “%@” is already installed.";
"The version being installed is either older or not compatible. Remove the existing extension before attempting to install another." = "The version being installed is either older or not compatible. Remove the existing extension before attempting to install another.";

"Could not locate the extension in the unarchived package." = "Could not locate the extension in the unarchived package.";
"The extension download server returned an unexpected status code (%d)." = "The extension download server returned an unexpected status code (%d).";
"An error was returned from the Extension Library." = "An error was returned from the Extension Library.";

"Authentication failed." = "Authentifizierung ist fehlgeschlagen.";

"ExtensionCategoryName_clips" = "Clips";
"ExtensionCategoryName_commands" = "Befehle";
"ExtensionCategoryName_completions" = "Vervollständigungen";
"ExtensionCategoryName_debuggers" = "Debugger";
"ExtensionCategoryName_formatters" = "Formatierer";
"ExtensionCategoryName_issues" = "Validierer";
"ExtensionCategoryName_key-bindings" = "Tastenzuordnungen";
"ExtensionCategoryName_languages" = "Sprachen";
"ExtensionCategoryName_tasks" = "Aufgaben";
"ExtensionCategoryName_sidebars" = "Seitenleisten";
"ExtensionCategoryName_themes" = "Themen";


// Extension Validation
"No extension logo image found." = "Kein Logobild für die Erweiterung gefunden.";
"A primary image is required named \"extension.png\" at the root of the extension bundle." = "Ein primäres Bild mit dem Namen „extension.png“ ist im Root des Erweiterungs-Bundles erforderlich.";

"Extension primary image too large." = "Primäres Bild der Erweiterung ist zu groß.";
"The extension's primary image should not be larger than 512px." = "Das primäre Bild der Erweiterung sollte nicht größer als 512 px sein.";

"No extension name specified." = "Kein Erweiterungsname angegeben.";
"A user-readable name must be specified for the extension." = "Für die Erweiterung muss ein vom Benutzer lesbarer Name angegeben werden.";

"No extension description specified." = "Keine Erweiterungsbeschreibung angegeben.";
"Providing a description helps to illustrate the usefulness of your extension to users." = "Das Bereitstellen einer Beschreibung hilft, die Nützlichkeit Ihrer Erweiterung für Benutzer zu veranschaulichen.";

"Invalid version number specified." = "Ungültige Versionsnummer angegeben.";
"Version numbers for extensions should follow a scheme such as \"xx.yy.zz\"." = "Versionsnummern für Erweiterungen sollten einem semantischen Versionierungsschema wie „xx.yy.zz“ folgen.";

"Version number is the same or older." = "Die Versionsnummer ist identisch oder älter.";
"The updated extension version number is the same or older than the currently published version. Bump your extension's version number to submit an update." = "Die aktualisierte Versionsnummer der Erweiterung ist dieselbe oder älter als die aktuell veröffentlichte Version. Erhöhen Sie die Versionsnummer Ihrer Erweiterung, um ein Update zu senden.";

"No organization specified." = "Kein Anbietername angegeben.";
"A user-readable organization name must be specified for the extension." = "Für die Erweiterung muss ein vom Benutzer lesbarer Anbietername angegeben werden.";

"The \"author\" metadata key is no longer supported." = "Der Metadatenschlüssel \"author\" wird nicht mehr unterstützt.";
"Use of the \"author\" key should be replaced with the \"organization\" key instead." = "Die Verwendung des Schlüssels \"author\" sollte stattdessen durch den Schlüssel \"organization\" ersetzt werden.";

"The \"vendor\" metadata key is no longer supported." = "Der Metadatenschlüssel \"vendor\" wird nicht mehr unterstützt.";
"Use of the \"vendor\" key should be replaced with the \"organization\" key instead." = "Die Verwendung des Schlüssels \"vendor\" sollte stattdessen durch den Schlüssel \"organization\" ersetzt werden.";

"No extension activation events specified." = "Keine Aktivierungsereignisse für Erweiterungen angegeben.";
"One or more activation events must be specified for extensions that include scripts." = "Für Erweiterungen, die Skripte enthalten, müssen ein oder mehrere Aktivierungsereignisse angegeben werden.";

"No extension categories specified." = "Keine Erweiterungskategorien angegeben.";
"Specifying categories helps users to find your extension in the library." = "Durch das Angeben von Kategorien können Benutzer Ihre Erweiterung in der Bibliothek finden.";

"Invalid extension category: \"%@\"." = "Ungültige Erweiterungskategorie: „%@“.";
"Ensure that the category identifiers you have specified exactly match those available in the documentation." = "Stellen Sie sicher, dass die von Ihnen angegebenen Kategoriebezeichner genau mit denen übereinstimmen, die in der Dokumentation verfügbar sind.";

"Missing components for category: \"%@\"." = "Fehlende Komponenten für Kategorie: „%@“.";
"Extensions using the Clips category must include at least one set of clips for the Clips sidebar." = "Erweiterungen, die die Kategorie „Clips“ verwenden, müssen mindestens einen Satz Clips für die Clips-Seitenleiste enthalten.";
"Extensions using the Commands category must include at least one command" = "Erweiterungen, die die Kategorie „Befehle“ verwenden, müssen mindestens einen Befehl enthalten";
"Extensions using the Key Bindings category must include at least one key binding set." = "Erweiterungen, die die Kategorie „Tastenzuordnungen“ verwenden, müssen mindestens einen Tastenzuordnungssatz enthalten.";
"Extensions using the Sidebars category must include at least one sidebar definition." = "Erweiterungen, die die Kategorie „Seitenleisten“ verwenden, müssen mindestens eine Seitenleistendefinition enthalten.";
"Extensions using the Tasks category must include at least one task configuration template definition." = "Erweiterungen, die die Kategorie „Aufgaben“ verwenden, müssen mindestens eine Definition für eine Aufgabenkonfigurationsvorlage enthalten.";
"Extensions using the Themes category must include at least one theme." = "Erweiterungen, die die Kategorie „Themen“ verwenden, müssen mindestens ein Thema enthalten.";

"A main script was specified but not found." = "Ein Hauptskript wurde angegeben, aber nicht gefunden.";
"The extension specifies a main script named “%@”, but the file could not be read. Check to ensure this file exists within the extension's \"Scripts/\" folder." = "Die Erweiterung gibt ein Hauptskript mit dem Namen „%@“ an, aber die Datei konnte nicht gelesen werden. Stellen Sie sicher, dass diese Datei im Ordner „Scripts/“ der Erweiterung vorhanden ist.";

"No bug reporting link specified." = "Kein Link für die Fehlerberichterstattung angegeben.";
"Specifying a bug reporting link helps users to submit issues related to your extension. Specify a URL and / or email address using the \"bugs\" key in your extension's manifest." = "Durch das Angeben eines Links für die Fehlerberichterstattung können Benutzer Probleme im Zusammenhang mit Ihrer Erweiterung senden. Geben Sie eine URL und/oder E-Mail-Adresse mithilfe des Schlüssels „bugs“ im Manifest Ihrer Erweiterung an.";

"No Readme found." = "Keine Infodatei gefunden.";
"A README.md file is required. Place this file in the root of the extension." = "Eine README.md-Datei ist erforderlich. Legen Sie diese Datei im Root der Erweiterung ab.";

"No Change Log found." = "Kein Änderungsprotokoll gefunden.";
"A CHANGELOG.md file is required. Place this file in the root of the extension." = "Eine CHANGELOG.md-Datei ist erforderlich. Legen Sie diese Datei im Root der Erweiterung ab.";

"Missing architectures in grammar library." = "Fehlende Architekturen in Grammatik-Bibliothek.";
"The grammar \"%@\" is missing one or more required architectures: (%@)." = "Der Grammatik „%@“ fehlen eine oder mehrere erforderliche Architekturen: (%@).";

"Invalid code signature for grammar library." = "Ungültige Codesignatur für Grammatik-Bibliothek.";
"The grammar \"%@\" does not have a valid code signature: %@." = "Die Grammatik „%@“ hat keine gültige Codesignatur: %@.";
